# Brewfile — Refineo laptop config (generated from audit 2026-07-06)
# Install everything:  brew bundle --file="$(dirname "$0")/Brewfile"

# ── CLI formulae ──────────────────────────────────────────────
brew "awscli"
brew "bcrypt"
brew "direnv"
# brew "docker"          # DROPPED — OrbStack provides the docker CLI + engine (decision 2026-07)
# brew "fzf"  # unused - keybindings never configured
brew "gh"
brew "git"
# brew "git-filter-repo"  # one-off tool, install on demand
brew "jq"
brew "libpq"
brew "mas"               # NEW — Mac App Store CLI (was missing on old machine)
brew "node"
brew "nvm"
brew "pnpm"
# brew "poppler"  # nothing references it
brew "postgresql@18"
brew "python@3.12"
brew "render"
brew "ripgrep"
# brew "speedtest-cli"  # unused
brew "supabase"
brew "tree"
brew "uv"
# brew "yt-dlp"  # was for MHC live-stream experiment (cbplay)

# ── Casks (were brew-managed on old machine) ─────────────────
cask "1password"
cask "1password-cli"
cask "anylist"
cask "copyclip"
cask "elgato-camera-hub"
cask "elgato-control-center"
cask "elgato-stream-deck"
# cask "iina"  # was for MHC live-stream experiment (cbplay)
cask "iterm2"
# cask "keyboard-maestro"  # ON HOLD 2026-07-09
# cask "notion"  # dropped 2026-07-09
cask "obs"
cask "obsidian"
cask "orbstack"
# cask "postman"  # ON HOLD 2026-07-09
cask "raycast"
cask "slack"
# cask "tableplus"  # dropped 2026-07-09
cask "visual-studio-code"
# cask "docker-desktop"  # DECISION: skip — OrbStack was the active docker context. Uncomment if you want both.

# ── Casks (hand-installed on old machine, now brew-managed) ──
cask "claude"
cask "google-chrome"
cask "linear-linear"
cask "telegram"
cask "whatsapp"
cask "scrivener"
# cask "cleanmymac"  # ON HOLD 2026-07-09
# cask "commander-one"  # dropped 2026-07-09
# Plottr — no cask; download from getplottr.com (manual install)

# ── Mac App Store (requires: signed into App Store, mas installed) ──
# mas "Keynote"  # skipped 2026-07-09, install when needed, id: 409183694
# mas "Pages"  # skipped 2026-07-09, install when needed, id: 409201541
# mas "Numbers"  # skipped 2026-07-09, install when needed, id: 409203825
# mas "GarageBand"  # skipped 2026-07-09, install when needed, id: 682658836
# mas "iMovie"  # skipped 2026-07-09, install when needed, id: 408981434
mas "Apple Remote Desktop", id: 409907375
# TurboTax 2025 + Under My Roof — install manually from App Store (search by name; ids vary)
